titoluyo/verticalparking/motor-control/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

CONFIG_MOTOR_CONTROL_RELAY_GPIO=10
CONFIG_MOTOR_CONTROL_RELAY_ACTIVE_HIGH=y
CONFIG_MOTOR_CONTROL_WIFI_SSID=""
CONFIG_MOTOR_CONTROL_WIFI_PASSWORD=""
CONFIG_MOTOR_CONTROL_MQTT_URI="mqtt://192.168.1.50:1883"
CONFIG_MOTOR_CONTROL_MQTT_USERNAME=""
CONFIG_MOTOR_CONTROL_MQTT_PASSWORD=""
CONFIG_MOTOR_CONTROL_MQTT_CLIENT_ID="motor-control"
CONFIG_MOTOR_CONTROL_MQTT_TOPIC="parking/garage-01/motor"
CONFIG_MOTOR_CONTROL_MQTT_QOS=1

